Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/three-kittens-and-chicken-little-omegat.tmx
Source language: en_us
Languages: chr

source: "Cockey Locky" the rooster was called.
chr: “ᏨᏨᏯ ᎠᏨᏯ” ᏚᏙᎥ ᏥᏔᎦ ᎠᏨᏯ.

source: "Come with me," said the fox.
chr: “ᏫᏨᏯᏘᏄᎦ,” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: "Dear me, what was that?"
chr: “Ꭷ, ᎦᏙ ᎤᏍᏗ?”

source: "Dear me," said she.
chr: “ᎯᎠ ᎤᏲ,” ᏄᏪᏎ.

source: "Ducky Lucky" the duck was called.
chr: “ᏌᏬᏄ ᎧᏬᏄ” ᏚᏙᎥ ᎧᏬᏄ.

source: "Foxy Loxy" the fox was called.
chr: “ᏧᎳ ᏧᏟ” ᏚᏙᎥ ᏧᏟ.

source: "Give me some pie," he said.
chr: “ᎨᎵᏍᏘᎩ ᎢᏍᎩᎥᏏ,” ᏄᏪᏎ.

source: "Good kittens," said Mother Cat.
chr: “ᎢᏦᏍᏓ ᎢᏥᏪᏌ ᎢᏥᏓ,” ᏄᏪᏎ ᎤᏂᏥ ᏪᏌ.

source: "Goosey Loosey" he was called.
chr: “ᏏᏏ ᏌᏌ” ᏚᏙᎥ.

source: "Ha, ha, ha!"
chr: “Ꭽ, Ꭽ, Ꭽ!”

source: "How do you do, kittens?"
chr: “ᎣᏏᏊᏍ ᏪᏌ ᎠᏂᏓ?”

source: "I do not see," said Chicken Little.
chr: “ᎥᏝ ᏱᏥᎪᏩᏘᎭ,” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "I see something!" said Mother Cat.
chr: “ᎪᎱᏍᏗ ᏥᎪᏩᏘᎭ!”, ᏄᏪᏎ ᎤᏂᏥ ᏪᏌ.

source: "I see something!" said the kittens.
chr: “ᎪᎱᏍᏗ ᎣᏥᎪᏩᏘᎭ!” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "I will go and tell the king."
chr: “ᎤᎬᏫᏳᎯ ᏓᏥᏃᎮᏞᎸᏏ.”

source: "I will go to the king.
chr: “ᎤᎬᏫᏳᎯ ᏓᎨᏅᏏ.

source: "I will go with you to tell the king.
chr: “ᎤᎬᏫᏳᎯ ᏓᏂᏃᎮᏞᎸᏏ.

source: "I will go with you, if I may," said Cocky Locky.
chr: “ᏕᏓᎵᎪᏅᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: "I will go with you, if I may," said Ducky Lucky.
chr: “ᏕᏓᎵᎪᏅᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏌᏬᏄ ᎧᏬᏄ.

source: "I will go with you, if I may," said Foxy Loxy.
chr: “ᏕᏓᎵᎪᏅᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: "I will go with you, if I may," said Goosey Loosey.
chr: “ᏕᏓᎵᎪᏅᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: "I will go with you, if I may," said Henny Penny.
chr: “ᎢᎾᎵᎪᏅᎭ ᎠᎴ ᎢᏁᏅᏒᎭ,” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "I will go with you, if I may," said Turkey Lurkey.
chr: “ᏕᏓᎵᎪᏅᎭ ᎠᎴ ᎢᏕᏅᏒᎭ,” ᏄᏪᏎ ᎬᏌ ᎬᎾ.

source: "I will have some fun," he said to himself.
chr: “ᏓᏥᏪᏢᏂ,” ᎤᏩᏌ ᎤᏬᏎᎴ.

source: "I will show you the way."
chr: “ᏄᏍᏗ ᎢᏨᎪᏛᏗᎭ.”

source: "It was the sky," said the sun.
chr: “ᎦᎸᎶ ᎨᏒ,” ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ.

source: "It was the sky," said the tree.
chr: “ᎦᎸᎶ ᎨᏒ,” ᏡᎬ ᎠᏗᏍᎩ ᎨᏎ.

source: "It was the sky," said the wind.
chr: “ᎦᎸᎶ ᎨᏒ,” ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ.

source: "Let us go and see."
chr: “ᏫᏗᎪᎱᎦ.”

source: "Look and see," said the sun.
chr: “ᎯᏲᎦ ᎠᎴ ᏘᎪᎯ,” ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ.

source: "Look and see," said the tree.
chr: “ᎯᏲᎦ ᎠᎴ ᏘᎪᎯ,” ᏡᎬ ᎠᏗᏍᎩ ᎨᏎ.

source: "Look and see," said the wind.
chr: “ᎯᏲᎦ ᎠᎴ ᏘᎪᎯ,” ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ.

source: "O dear!
chr: “Ꭳ ᎯᎠ ᎤᏲ!

source: "O!
chr: “Ꭳ!

source: "O, I will have some fun.
chr: “Ꭳ, ᏓᏥᏪᏢᏂ.

source: "O, how do you do, magpie?
chr: “Ꭳ, ᎣᏏ, ᏂᎯᎾ, ᏩᏘᏰᎵ?

source: "O, just for fun," said the magpie.
chr: “Ꭳ, ᎦᎵᎡᎵᎦᏊ," ᏄᏪᏎ ᏩᏘᏰᎵ.

source: "O, no," said the kittens.
chr: “Ꭳ, Ꮭ,” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "Sigisi Agisi" the hen was called.
chr: “ᏏᎩᏏ ᎠᎩᏏ” ᏚᏙᎥ ᏥᏔᎦ ᎠᎩᏏ.

source: "The sky is falling," said the sun.
chr: “ᎦᎸᎶ ᎪᎰᏍᎦ,” ᏅᏓ ᎠᏗᏍᎩ ᎨᏎ.

source: "The sky is falling," said the tree.
chr: “ᎦᎸᎶ ᎪᎰᏍᎦ,” ᏡᎬ ᎠᏗᏍᎩ ᎨᏎ.

source: "The sky is falling," said the wind.
chr: “ᎦᎸᎶ ᎪᎰᏍᎦ,” ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏎ.

source: "The wind told me.
chr: “ᎤᏃᎴ ᎠᎩᏃᎮᏏ.

source: "The wind told us all.
chr: “ᎤᏃᎴ ᎣᎩᏃᎮᏏ.

source: "The wind told us both.
chr: “ᎤᏃᎴ ᎣᎩᏂᏃᎮᏏ.

source: "The wind told us.
chr: “ᎤᏃᎴ ᎣᎩᏃᎮᏏ.

source: "They are clean white mittens.
chr: “ᎥᏍᎩ ᏧᏓᏅᎦᎸᏓ ᎠᎴ ᏧᏁᎦ.

source: "Turkey Lurkey" the turkey was called.
chr: “ᎬᏌ ᎬᎾ” ᏚᏙᎥ ᎬᎾ.

source: "We all go to tell the king that the sky is falling."
chr: ᎤᎬᏫᏳᎯ ᎣᏥᏃᎮᏞᎴᎦ ᎦᎸᎶ ᎪᎰᏍᎦ.”

source: "We will go with you.
chr: “ᎢᏍᎩᏯᏘᏁᎨᏍᏗ.

source: "We will hunt for them.
chr: “ᏙᏓᏲᎩᏯᎸᏏ.

source: "We will try to keep them clean.
chr: “ᎥᏍᎩᎾ ᏧᏓᏅᎦᎸᏓ ᎨᏎᏍᏗ ᏓᏲᏣᏁᏟᏔᏂ”

source: "We will try," said the kittens.
chr: “ᏓᏲᏣᏁᏟᏔᏂ,” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "What a strange bird!" said the kittens.
chr: “Ꮎ ᏥᏍᏆ ᎠᏎᎩ!” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "What a strange magpie!"
chr: “ᏩᏘᏰᎵ ᎠᏎᎩ!”

source: "What is it?" said Mother Oat.
chr: “ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᎤᏂᏥ ᏪᏌ.

source: "What is it?" said the kittens.
chr: “ᎦᏙ ᎤᏍᏗ?” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "What was it?
chr: “ᎦᏙ ᎤᏍᏗ ᎨᏎ?

source: "What was it?"
chr: “ᎦᏙ ᎤᏍᏗ?”

source: "What was it?" she said.
chr: “ᎦᏙ ᎤᏍᏗ ᎨᏎ?” ᏄᏪᏎ.

source: "What was that, O sun?" said Chicken Little.
chr: “Ꭷ ᏅᏓ, ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "What was that, O tree?" said Chicken Little.
chr: “Ꭷ ᏡᎬ, ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "What was that, O wind?" said Chicken Little.
chr: “Ꭷ ᎤᏃᎴ, ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "What was that?" she said.
chr: “ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ.

source: "Where am I going?
chr: “ᎭᏢ ᎨᎦ?

source: "Where are we all going?
chr: “ᎭᏢ ᎣᏤᎦ?

source: "Where are we two going?
chr: “ᎭᏢ ᎣᏍᏕᎦ?

source: "Where are you going, Chicken Little?
chr: “ᎭᏢ ᎮᎦ, ᏥᏔᎦ ᎤᏍᏗ?

source: "Where are you going, Chicken Little?" said Henny Penny.
chr: “ᎭᏢ ᎮᎦ, ᏥᏔᎦ ᎤᏍᏗ?” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "Where is the king?"
chr: “ᎭᏢ ᎤᎬᏫᏳᎯ?”

source: "Who told you all so?"
chr: “ᎦᎪ ᎢᏥᏃᎮᏞᎴ?”

source: "Who told you one so?"
chr: “ᎦᎪ ᏣᏃᎮᏞᎴ?”

source: "Who told you two so?"
chr: “ᎦᎪ ᏍᏗᏃᎮᏞᎴ?”

source: "Why do you laugh?" said the kittens.
chr: “ᎦᏙᎲ ᏣᏰᏘᏍᎦ?” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "Why, why, why!"
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!”

source: "Why, why, why!" said Cocky Locky.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: "Why, why, why!" said Ducky Lucky.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏌᏬᏄ ᎧᏬᏄ.

source: "Why, why, why!" said Foxy Loxy.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏧᎳ ᏧᏟ.

source: "Why, why, why!" said Goosey Loosey.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: "Why, why, why!" said Henny Penny.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "Why, why, why!" said Turkey Lurkey.
chr: “ᎦᏙ, ᎦᏙ, ᎦᏙ!” ᏄᏪᏎ

source: "Yes, I see them," said the magpie.
chr: “ᎥᎥ, ᏕᏥᎪᏩᏘ,” ᎤᏛᏁ ᏩᏘᏰᎵ.

source: "Yes, they are silk."
chr: “ᎥᎥ, ᏏᎵᎩ.”

source: "Yes," said Chicken Little.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: "Yes," said Cocky Locky.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏨᏨᏯ ᎠᏨᏯ.

source: "Yes," said Ducky Lucky.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏌᏬᏄ ᎧᏬᏄ.

source: "Yes," said Goosey Loosey.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏏᏏ ᏌᏌ.

source: "Yes," said Henny Penny.
chr: “ᎥᎥ,” ᏄᏪᏎ ᏏᎩᏏ ᎠᎩᏏ.

source: "Yes," said Turkey Lurkey.
chr: “ᎥᎥ,” ᏄᏪᏎ ᎬᏌ ᎬᎾ.

source: "Yes," said the kittens.
chr: “ᎥᎥ,” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "You are a bad bird.
chr: “ᏣᏲᎢ ᏥᏍᏆ.

source: Alas, poor silly Chicken Little!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏥᏔᎦ ᎤᏍᏗ!

source: Alas, poor silly Cocky Locky!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏨᏨᏯ ᎠᏨᏯ!

source: Alas, poor silly Ducky Lucky!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏌᏬᏄ ᎧᏬᏄ!

source: Alas, poor silly Goosey Loosey!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏏᏏ ᏌᏌ!

source: Alas, poor silly Henny Penny!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᏏᎩᏏ ᎠᎩᏏ!

source: Alas, poor silly Turkey Lurkey!
chr: Ꭳ, ᎤᏲ ᎤᏬᎵᏗ ᎬᏌ ᎬᎾ!

source: An acorn fell.
chr: ᎫᎴ ᎤᏬᎰᏎ.

source: And away the five ran.
chr: ᎠᎴ Ꮎ ᎯᏍᎩ ᎤᎾᎵᏘᏎ.

source: And away the four ran.
chr: ᎠᎴ Ꮎ ᏅᎩ ᎤᎾᎵᏘᏎ.

source: And away the seven ran.
chr: ᎠᎴ Ꮎ ᎦᎵᏉᎩ ᎤᎾᎵᏘᏎ.

source: And away the six ran.
chr: ᎠᎴ Ꮎ ᏑᏓᎵ ᎤᎾᎵᏘᏎ.

source: And away the three ran.
chr: ᎠᎴ Ꮎ ᎠᏂᏦᎢ ᎤᎾᎵᏘᏎ.

source: And away the two ran.
chr: ᎠᎴ Ꮎ ᎠᏂᏔᎵ ᎤᎾᎵᏘᏎ.

source: And the sun laughed.
chr: ᏅᏓᏃ ᎤᏰᏘᏍᎩ ᎨᏎ.

source: And the sun told me.
chr: ᏅᏓᏃ ᎠᎩᏃᎮᏏ.

source: And the sun told us all.
chr: ᏅᏓᏃ ᎣᎩᏃᎮᏏ.

source: And the sun told us both.
chr: ᏅᏓᏃ ᎣᎩᏂᏃᎮᏏ.

source: And the sun told us.
chr: ᏅᏓᏃ ᎣᎩᏃᎮᏏ.

source: And the tree laughed.
chr: ᏡᎬᏃ ᎤᏰᏘᏍᎩ ᎨᏎ.

source: And the tree told me.
chr: ᏡᎬᏃ ᎠᎩᏃᎮᏏ.

source: And the tree told us all.
chr: ᏡᎬᏃ ᎣᎩᏃᎮᏏ.

source: And the tree told us both.
chr: ᏡᎬᏃ ᎣᎩᏂᏃᎮᏏ.

source: And the tree told us.
chr: ᏡᎬᏃ ᎣᎩᏃᎮᏏ.

source: And the tree told us."
chr: ᏡᎬᏃ ᎣᎩᏃᎮᏏ.”

source: And the tricky fox laughed over and over.
chr: ᎠᎴ ᎤᏲᎢ ᏧᏟ ᎤᏰᏘᏏᎶᎡ.

source: And they began to cry.
chr: ᎠᎴ ᏧᎾᏠᏱᏍᏗ ᎤᎾᎴᏅᎮ.

source: And you shall have some pie.
chr: ᎠᎴ ᎨᎵᏍᏘᎩ ᏓᏥᎯ.

source: Are the mittens in the bag?
chr: ᏕᎦᎵᏗᎯᏍ ᏗᎵᏰᏑᎶ?

source: Are the mittens in the box?
chr: ᏗᎵᏰᏑᎶᏍ ᎧᏁᏌᎢ ᎤᎾᏣᎠ?

source: Are the mittens on the shelf?
chr: ᎤᎾᎩᎳᏍ ᎠᏯᏔᎾᎸ?

source: Are the mittens on the table?
chr: ᎦᏍᎩᎶᎢᏍ ᏗᎵᏰᏑᎶ?

source: Are they in the tub?
chr: ᏒᏙᏂᏍ ᎠᏂᎳᎠ?

source: Are they not in the tub?
chr: ᏒᏙᏂᏧ ᎠᏂᎳᎠ?

source: Are they not on the line?
chr: ᏍᏕᏱᏓᏧ ᎠᎾᏓᎠ?

source: Are they on the line?
chr: ᏍᏕᏱᏓᏍ ᎠᎾᏓᎠ?

source: Are they silk mittens?"
chr: ᎨᎪᏢᏅ ᏏᎵᎩ ᎬᏗ?”

source: Are your mittens clean?
chr: ᏧᏓᏅᎦᎸᏓᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: Are your mittens silk?
chr: ᏗᏣᏤᎵᏍ ᏗᎵᏰᏑᎶ ᏏᎵᎩ ᎬᏗ ᎨᎪᏢᏅᎢ?

source: Are your mittens white silk?
chr: ᏧᏁᎦᏍ ᏏᎵᎩ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: Are your mittens white?
chr: ᏧᏁᎦᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: Boil, boil, boil!
chr: ᎨᎦᎵᏟᏓᏂᎶᎥᎢ ᎨᏎᏍᏗ!

source: But we will look for them.
chr: ᎠᏎᏃ ᏙᏓᏥᏯᎵ.

source: Can the kittens wash?
chr: ᏗᎬᏩᏅᎩᎶᏍᏗᏍ ᏪᏌ ᎠᏂᏓ?

source: Can we have no pie?
chr: ᏝᏍᎪ ᎨᎵᏍᏘᎩ ᏱᏓᏲᎩᎯ?

source: Can you say mew, mew, mew?
chr: ᎡᎵᏊᏍ ᎯᎠ ᏱᏂᏫ, “ᎻᏳ, ᎻᏳ, ᎻᏳ”?

source: Can you talk with us?
chr: ᎡᎵᏊᏍ ᏱᏂᏍᎩᏪᏎᎵ?

source: Can you talk, little boy?
chr: ᎡᎵᏊᏍ ᏱᏂᏫ, ᎤᏍᏗ ᎠᏧᏣ?

source: Can you talk, little girl?
chr: ᎡᎵᏊᏍ ᏱᏂᏫ, ᎤᏍᏗ ᎠᎨᏳᏣ?

source: Chicken Little did not see what it was.
chr: ᏥᏔᎦ ᎤᏍᏗ Ꮭ ᎪᎱᏍᏗ ᏳᎪᎮ.

source: Chicken Little is female.
chr: ᏥᏔᎦ ᎤᏍᏗ ᎠᎩᏏ.

source: Chicken Little was out in the woods.
chr: ᏥᏔᎦ ᎤᏍᏗ ᎢᎾᎨᎢ ᎤᏪᏙᎴ.

source: Did you hear us?
chr: ᎢᏍᎩᏯᏛᎬᎦᏍ?

source: Did you put them in the box?
chr: ᏕᏥᎸᏁᏍ ᎧᏁᏌᎢ?

source: Did you put them on the table?
chr: ᏕᏥᎲᎦᏍ ᎦᏍᎩᎶᎢ?

source: Do we wash our mittens?
chr: ᏙᏨᎩᎶᏍᎪᏍ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: Do you keep them clean?
chr: ᎭᏁᏟᏗᏍᎪᏍ ᏗᏣᏤᎵ ᏧᏓᏅᎦᎸᏓ ᎨᏒ?

source: Do you like our mittens?
chr: ᏕᏣᎸᏉᏗᏍ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: Do you see our white mittens?"
chr: ᏕᎯᎪᏩᏘᏍ ᏦᎦᏤᎵ ᏧᏁᎦ ᏗᎵᏰᏑᎶ?”

source: Do you soil your mittens, little boy?
chr: ᏗᎦᏓᎭᏍ ᏄᎾᎵᏍᏗᏍᎪ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ, ᎤᏍᏗ ᎠᏧᏣ?

source: Do you soil your mittens, little girl?
chr: ᏗᎦᏓᎭᏍ ᏄᎾᎵᏍᏗᏍᎪ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ, ᎤᏍᏗ ᎠᎨᏳᏣ?

source: Foxy Loxy had a cave in the woods.
chr: ᏧᎳ ᏧᏟ ᎤᏤᎵ ᎤᏍᏓᎦᎸᎢ ᎢᎾᎨᎢ ᎠᏰᎵ ᎨᏎ.

source: Good little kittens.
chr: ᎠᏃᏍᏓ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: Ha, ha!
chr: Ꭽ, Ꭽ!

source: Had found their mittens,
chr: ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏥᏚᏂᏩᏛᎮ,

source: Have you a mitten, too?
chr: ᎠᎵᏰᏑᎶᏍ ᎥᏍᏊ ᏣᎾᎠ?

source: Have you lost your mittens?
chr: ᏕᏥᏲᎱᏏᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: Have you mittens, little boy?
chr: ᏗᎵᏰᏑᎶᏍ ᏕᏣᎾᎠ, ᎤᏍᏗ ᎠᏧᏣ?

source: Have you mittens, little girl?
chr: ᏗᎵᏰᏑᎶᏍ ᏕᏣᎾᎠ, ᎤᏍᏗ ᎠᎨᏳᏣ?

source: Have you mittens, too?
chr: ᏗᎵᏰᏑᎶᏍ ᎥᏍᏊ ᏕᏣᎾᎠ?

source: He flew to the roof.
chr: ᎤᏝᏫᏛᎮ ᎠᎴ ᎦᏌᎾᎵ ᎤᏪᏅᏎ.

source: He flew up to the roof.
chr: ᎤᏝᏫᏛᎮ ᎠᎴ ᎦᏌᎾᎵ ᏭᏪᏅᏎ.

source: He has put them on the roof.
chr: ᎦᏌᎾᎵ ᏚᏁ.

source: He is a bad bird.
chr: Ꮎ ᏥᏍᏆ ᎤᏲᎢ.

source: He knows where the mittens are.
chr: ᎤᎿ ᏗᎵᏰᏑᎶ ᎤᏅᏔ.

source: He knows!
chr: ᎤᏅᏔ!

source: He likes to hide mittens.
chr: ᏗᎵᏰᏑᎶ ᏧᏩᏍᎦᎸᏗ ᎤᎸᏉᏗ.

source: He likes to hide.
chr: ᎤᏩᏍᎦᎸᏗ ᎤᎸᏉᏙ.

source: He likes to steal mittens.
chr: ᏗᎵᏰᏑᎶ ᏧᏃᏍᎩᏍᏗ ᎤᎸᏉᏗ.

source: He likes to steal.
chr: ᎤᏃᏍᎩᏍᏗ ᎤᎸᏉᏙ.

source: He will hide the mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᏓᎬᏍᎦᎸᏂ.

source: Hear me talk to them.
chr: ᏂᎦᏥᏪᏒᎢ ᎭᏛᎬᎦ.

source: Hear what I say, little kittens.
chr: ᎠᏆᏛᏅᎢ ᎢᏣᏛᎬᎦ, ᏗᏆᏤᎵ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: Here is a bag.
chr: ᎠᏂ ᏕᎦᎵᏗ.

source: Here is a magpie.
chr: ᎠᏂ ᏩᏘᏰᎵ.

source: Here is a shelf.
chr: ᎠᏂ ᎠᏯᏔᎾᎸᎢ.

source: Here is the table.
chr: ᎠᏂ ᎦᏍᎩᎶ.

source: How can I get them?
chr: ᎦᏙ ᏗᎩᏁᏍᏗ ᏓᎦᏛᏁᎵ?

source: How could they get upon the shelf?
chr: ᎦᏙ ᎠᏛᏁᏗ ᎠᏯᏔᎾᎸ ᎤᎾᎩᎳ?

source: How do you do, kittens?
chr: ᎣᏏᏊᏍ, ᏪᏌ ᎠᏂᏓ?

source: How do you do?
chr: ᎣᏏᏊᏍ?

source: I do not like naughty kittens.
chr: ᎤᏂᏲ ᏪᏌ ᎠᏂᏓ Ꮭ ᏱᎦᏥᎸᏉᏙ.

source: I go to tell the king."
chr: ᎤᎬᏫᏳᎯ ᏥᏃᎮᏞᎴᎦ.”

source: I saw you boil them.
chr: ᏕᏣᎵᏟᏓᏅ ᎠᎩᎪᎲᎩ.

source: I saw you hang them on the line.
chr: ᏍᏕᏱᏓ ᏕᏣᏛᎥᏍᎬ ᏥᎪᏩᏔ.

source: I saw you hang them out to dry.
chr: ᎤᏂᎧᏲᎯᏍᏗ ᏕᏣᏛᏅ ᎠᎩᎪᎲᎩ.

source: I saw you rub them.
chr: ᏕᏣᏍᎪᎵᏰᎢᎶᎥ ᎠᎩᎪᎲᎩ.

source: I saw you soap them.
chr: ᎣᏝ ᎢᏥᏝᏅ Ꮎ ᏗᎵᏰᏑᎶ ᎠᎩᎪᎲᎩ.

source: I saw you wash them.
chr: ᏕᏨᎩᎶᏍᎬ ᏥᎪᏩᏔ.

source: I will go to the king.
chr: ᎤᎬᏫᏳᎯ ᏓᎨᏅᏏ.

source: I will hide them.
chr: ᏙᏓᎬᏍᎦᎸᏂ.

source: I will steal the mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᏓᏥᏃᏍᎩᏏ.

source: I will talk to the kittens.
chr: ᏪᏌ ᎠᏂᏓ ᏂᏓᎦᏥᏪᏎᎵ.

source: I will tell him what the sun said.
chr: ᏅᏓ ᎧᏃᎮᏍᎬᎢ ᏓᏥᏃᎮᏞᎵ.

source: I will tell him what the tree said.
chr: ᏡᎬ ᎧᏃᎮᏍᎬᎢ ᏓᏥᏃᎮᏞᎵ.

source: I will tell him what the wind said.
chr: ᎤᏃᎴ ᎧᏃᎮᏍᎬᎢ ᏓᏥᏃᎮᏞᎵ.

source: I will tell the king."
chr: ᎤᎬᏫᏳᎯ ᏓᏥᏃᎮᏞᎵ.”

source: It fell on her head.
chr: ᎠᏍᎪᎵ ᎦᏚ ᎤᏬᎰᏎ.

source: It is a good pie.
chr: ᎯᎠ ᎨᎵᏍᏘᎩ ᎣᏍᏓ.

source: It will do no harm to look.
chr: ᎤᏲᎢ ᏂᎨᏒᎾ ᏱᏙᏥᏯᎴᎨᏍᏗ.

source: Keep away from the magpie, kittens.
chr: ᏩᏘᏰᎵ ᎤᏟ ᏫᏤᏓ, ᏪᏌ ᎠᏂᏓ.

source: Let us hunt for our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏫᏙᎩᏯᎷᎦ.

source: Let us look into the bag.
chr: ᏕᎦᎵᏗᎯ ᏦᏥᏲᎦ.

source: Let us look on that chair.
chr: Ꮎ ᎦᏍᎩᎶ ᏫᏙᎩᏯᎷᎦ.

source: Let us look on the stairs.
chr: ᎠᎩᏠᏒᏍᏗ ᏫᏙᎩᏯᎷᎦ.

source: Let us look on this chair.
chr: ᎯᎠ ᎦᏍᎩᎶ ᏫᏙᎩᏱᎦ.

source: Let us see your mittens, little boy.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏫᏦᏥᎪᏩᏔ, ᎤᏍᏗ ᎠᏧᏣ.

source: Let us see your mittens, little girl.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏫᏦᏥᎪᏩᏔ, ᎤᏍᏗ ᎠᎨᏳᏣ.

source: Look here, look here !
chr: Ꮒ! Ꮒ! ᎠᏂ!

source: Mew, mew!
chr: ᎻᏳ, ᎻᏳ!

source: Mew, mew, mew!
chr: ᎻᏳ, ᎻᏳ, ᎻᏳ!

source: No, no; you shall have, no pie."
chr: ᎥᏝ, ᎥᏝ. ᎨᎵᏍᏘᎩ ᏂᏣᎲᎾ ᎨᏎᏍᏗ.”

source: No, the mittens are not there.
chr: ᏗᎵᏰᏑᎶ ᎥᏝ ᎤᎿ ᏱᎩ.

source: No, they are not here.
chr: ᎥᏍᎩ ᎥᏝ ᎠᎭᏂ ᏱᎩ.

source: No, they are not in the tub.
chr: ᎥᏝ ᏒᏙᏂ ᏳᎾᏣᎠ.

source: No, they are not on the stairs.
chr: ᎠᎩᏠᏒᏍᏗ ᎥᏝ ᎤᎿ ᏱᎩ.

source: No, they are not there.
chr: ᎥᏝ ᎤᎿ ᏱᎩ.

source: No, we did not put them in the box.
chr: ᎥᏝ ᎧᏁᏌᎢ ᏱᏙᎩᎸᏅᎩ.

source: No, we did not put them on the table.
chr: ᎥᏝ ᏱᏗᏥᎲᎦ ᎦᏍᎩᎶ.

source: No, we shall not find them on the line.
chr: ᎥᏝ ᏍᏕᏱᏓᎢ ᏱᏙᏓᏲᏥᏩᏛᎯ.

source: No, we shall not find them there.
chr: ᎥᏝ ᎤᎿ ᏱᏙᏓᏲᏥᏩᏛᎯ.

source: Now the mittens are clean.
chr: ᏃᏊ ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ.

source: Now the mittens are white.
chr: ᏃᏊ ᏗᎵᏰᏑᎶ ᏧᏁᎦ.

source: Now they will dry.
chr: ᏃᏊ ᏛᏂᎧᏲᏏ.

source: Now when the kittens
chr: ᏃᏊᎴ ᏪᏌ ᎠᏂᏓ

source: Now, we will comb our hair.
chr: ᏃᏊ, ᏙᏓᏲᏣᎵᏔᏬᎢ.

source: Now, we will come down stairs.
chr: ᏃᏊ, ᎠᎩᏠᏒᏍᏗᎢ ᎡᎳᏗ ᏓᏲᏤᏅᏏ.

source: Now, we will sit at the table.
chr: ᏃᏊ, ᎦᏍᎩᎶᎢ ᏓᏲᏣᎵᎪᏂ.

source: Now, we will sit in our chairs.
chr: ᏃᏊ, ᏦᎦᏤᎵ ᏗᎦᏍᎩᎶᎯ ᏙᏓᏲᏦᏟ.

source: Now, we will wash our faces.
chr: ᏃᏊ, ᏙᏓᏲᏣᎬᏍᏉᎢ.

source: O dear!" said Chicken Little.
chr: Ꭳ ᎯᎠ ᎤᏲ!” ᏄᏪᏎ ᏥᏔᎦ ᎤᏍᏗ.

source: O dear, dear!
chr: Ꭳ ᎤᏲᎢ, ᎤᏲᎢ!

source: O where are our mittens?
chr: Ꭳ, ᎭᏢ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: O!
chr: Ꭳ!

source: O!" they cried.
chr: Ꭳ!” ᏍᏓᏯ ᏄᏂᏪᏎ.

source: O, here is the pie!
chr: Ꭳ, ᎨᎵᏍᏘᎩ ᎠᏂ!

source: O, mother dear,
chr: Ꭳ, ᎡᏥ ᎡᏥ,

source: O, mother dear, we greatly fear,
chr: Ꭳ, ᎡᏥ ᎡᏥ, ᎡᏆ ᎣᏥᏍᎦᎭ ᎯᎠ,

source: O, mother, mother!
chr: Ꭳ, ᎡᏥ, ᎡᏥ!

source: O, mother, mother, mother!
chr: Ꭳ, ᎡᏥ, ᎡᏥ, ᎡᏥ!

source: O, no, little kittens.
chr: Ꭳ, ᎥᏝ, ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: O, no, no!
chr: Ꭳ, Ꮭ, ᎥᏝ!

source: O, we have found our mittens.
chr: Ꭳ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏩᏔ.

source: O, we have lost our mittens!
chr: Ꭳ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ!

source: O, what a good pie!"
chr: Ꭳ, ᎯᎠ ᎨᎵᏍᏘᎩ ᎣᏏᏊ!”

source: O, where are our mittens?
chr: Ꭳ, ᎭᏢ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: O, where can they be?
chr: Ꭳ, ᎭᏢ ᎥᏍᎩᎾ?

source: O, yes, they can wash.
chr: Ꭳ, ᎥᎥ, ᏗᎬᏩᏅᎩᎶᏍᏗ.

source: O, yes, we can talk.
chr: Ꭳ, ᎥᎥ, ᎡᎵᏊ ᏱᏂᏨᏪᏎᎵ.

source: O, you little kittens!
chr: Ꭳ, ᏂᎯ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ!

source: O, you naughty kittens!
chr: Ꭳ, ᎤᏂᏲ ᏪᏌ ᎠᏂᏓ!

source: On the way Chicken Little met a hen.
chr: ᎾᎯᏳ ᏥᏔᎦ ᎤᏍᏗ ᎠᎴ ᏥᏔᎦ ᎠᎩᏏ ᏚᎾᏠᏎ.

source: On the way they met a female duck.
chr: ᎾᎯᏳ Ꮎ ᎠᏂᏦ ᎠᎴ ᎧᏬᏄ ᎠᎩᏏ ᏓᎾᏠᏎ.

source: On the way they met a fox.
chr: ᎾᎯᏳ ᎥᏍᎩᎾ ᎠᎴ ᏧᏟ ᏓᎾᏠᏎ.

source: On the way they met a gander.
chr: ᎾᎯᏳ ᎥᏍᎩᎾ ᎠᎴ ᏌᏌ ᎠᏨᏯ ᏓᎾᏠᏎ.

source: On the way they met a turkey.
chr: ᎾᎯᏳ ᎥᏍᎩᎾ ᎠᎴ ᎬᎾ ᏓᎾᏠᏎ.

source: On the way they met rooster.
chr: ᎾᎯᏳ Ꮎ ᎠᏂᏔᎵ ᎠᎴ ᏥᏔᎦ ᎠᏨᏯ ᏓᎾᏠᏎ.

source: One day they were up in a tree.
chr: ᏏᎦ ᏡᎬᎢ ᎤᏂᎸᏎ.

source: One kitten.
chr: ᏌᏊ ᏪᏌ ᎠᏓ.

source: One, two kittens.
chr: ᏌᏊ, ᎠᏂᏔᎵ ᏪᏌ ᎠᏂᏓ.

source: One, two, three kittens.
chr: ᏌᏊ, ᎠᏂᏔᎵ, ᎠᏂᏦᎢ ᏪᏌ ᎠᏂᏓ.

source: Our clean, white mittens!
chr: ᏦᎦᏤᎵ ᏧᏓᏅᎦᎸᏓ ᏧᏁᎦ ᏗᎵᏰᏑᎶ!

source: Our mittens are clean.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ.

source: Our mittens are silk.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏏᎵᎩ ᎬᏗ ᎨᎪᏢᏅᎢ.

source: Our mittens are white silk.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏁᎦ ᏏᎵᎩ.

source: Our mittens are white.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏁᎦ.

source: Our mittens we have found.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᏥᏩᏔ.

source: Our mittens we have lost.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ.

source: Our white, silk mittens!
chr: ᏦᎦᏤᎵ ᏧᏁᎦ ᏏᎵᎩ ᏗᎵᏰᏑᎶ!

source: Poor little kittens.
chr: ᎤᏂᏲ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: Purr-rr-rr!
chr: ᏥᏥ-ᏥᏥ-Ꮵ!

source: Put on your mittens,
chr: ᏗᏥᏤᎵ ᏗᎵᏰᏑᎶ ᏗᏣᎵᏰᏑᎸᎦ,

source: Rub, rub, rub!
chr: ᎨᎦᏍᎪᎵᏰᎢᎶᎥᎢ ᎨᏎᏍᏗ!

source: See him laugh!
chr: Ꮒ, ᎤᏰᏘᏍᎦ!

source: See how clean our mittens are!
chr: Ꮒ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᏳᎯ ᏧᏓᏅᎦᎸᏓ!

source: See how white the mittens are.
chr: Ꮒ, ᏗᎵᏰᏑᎶ ᏭᎪᏛ ᏧᏁᎦ.

source: See the kittens.
chr: ᏪᏌ ᎠᏂᏓ ᎦᎯᎪᏩᏔ.

source: See the magpie!
chr: Ꮒ, ᎤᎿ ᏩᏘᏰᎵ!

source: See the three kittens.
chr: ᎠᏂᏦᎢ ᏪᏌ ᎠᏂᏓ ᎦᎯᎪᏩᏔ.

source: See where he has put them.
chr: Ꮒ, ᎤᎿ ᏚᏁ.

source: See, here is a box.
chr: Ꮒ, ᎠᎭᏂ ᎧᏁᏌᎢ.

source: See, little boy.
chr: Ꮒ, ᎤᏍᏗ ᎠᏧᏣ.

source: See, little girl.
chr: Ꮒ, ᎤᏍᏗ ᎠᎨᏳᏣ.

source: See, the mittens are on the line.
chr: Ꮒ, ᏗᎵᏰᏑᎶ ᏍᏕᏱᏓ ᎠᎾᏓᎠ.

source: See, we have found our mittens.
chr: Ꮒ! ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏩᏔ.

source: Shall we find them in the tub?
chr: ᏙᏓᏲᏥᏩᏛᎯᏍ ᏒᏙᏂ?

source: Shall we find them on the line?
chr: ᏙᏓᏲᏥᏩᏛᎯᏍ ᏍᏕᏱᏓᎢ?

source: Shall we look in the tub?
chr: ᏙᎩᏯᎸᏒᎭᏍ ᏒᏙᏂ?

source: Shall we look on the line?"
chr: ᏙᎩᏯᎸᏒᎭᏍ ᏍᏕᏱᏓᎢ?

source: She did not see the acorn.
chr: Ꮭ ᎫᎴ ᏳᎪᎮ.

source: She flew and she flew.
chr: ᎦᏃᎯᎵᏎ ᎠᎴ ᎦᏃᎯᎵᏎ.

source: She ran and she ran.
chr: ᎠᏟᏎ ᎠᎴ ᎠᏟᏎ.

source: Show us the way."
chr: ᏄᏍᏗ ᎢᏍᎩᎪᏩᏛᏓ.”

source: So Foxy Loxy led Chicken Little, Henny Penny, Cocky Locky, Ducky Lucky, Goosey Loosey and Turkey Lurkey into the woods.
chr: ᏃᏊᎴ ᏥᏔᎦ ᎤᏍᏗ, ᏏᎩᏏ ᎠᎩᏏ, ᏨᏨᏯ ᎠᏨᏯ, ᏌᏬᏄ ᎧᏬᏄ, ᏏᏏ ᏌᏌ, ᎠᎴ ᎬᏌ ᎬᎾ ᏚᏘᏅᏎ ᏧᎳ ᏧᏟ ᎢᎾᎨᎢ ᎠᏰᎵ.

source: So he led Chicken Little and her friends to the cave.
chr: ᎤᏍᏓᎦᎸᎢ ᏚᏘᏅᏎ, ᏥᏔᎦ ᎤᏍᏗ ᎠᎴ ᏧᎾᎵ..

source: So off flew Chicken Little to tell the king.
chr: ᏃᏊᎴ ᎤᎬᏫᏳᎯ ᎤᏃᎮᏞᏗ ᎤᏝᏫᏛᎮ ᏥᏔᎦ ᎤᏍᏗ.

source: So the kittens came down from the tree.
chr: ᎠᎴ ᏪᏌ ᎠᏂᏓ ᏡᎬ ᎡᎳᏗ ᎤᏂᎸᏎ.

source: So the magpie stole the mittens.
chr: ᏃᏊᎴ ᏩᏘᏰᎵ ᏗᎵᏰᏑᎶ ᏚᏃᏍᎩᏎ.

source: THE STORY OF CHICKEN LITTLE.
chr: ᎧᏃᎮᏢᏍᎦ ᏥᏔᎦ ᎤᏍᏗ.

source: THREE LITTLE KITTENS.
chr: Ꮎ ᎠᏂᏦᎢ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: Tell me, sun.
chr: Ꭷ ᏅᏓ, ᏍᎩᏃᎮᏏ.

source: Tell me, tree.
chr: Ꭷ ᏡᎬ, ᏍᎩᏃᎮᏏ.

source: Tell me, wind.
chr: Ꭷ ᎤᏃᎴ, ᏍᎩᏃᎮᏏ.

source: The cave was his home.
chr: Ꮎ ᎤᏍᏓᎦᎸ ᏧᏪᏅᏒᎢ.

source: The clean, white mittens!
chr: ᏧᏓᏅᎦᎸᏓ ᏧᏁᎦ ᏗᎵᏰᏑᎶ!

source: The clean, white, silk mittens!
chr: ᏧᏓᏅᎦᎸᏓ ᏧᏁᎦ ᏏᎵᎩ ᏗᎵᏰᏑᎶ!

source: The kittens began to cry.
chr: ᏪᏌ ᎠᏂᏓ ᎠᎾᏠᏱᎸ ᎤᎾᎴᏅᎮ.

source: The kittens can not find them.
chr: Ꮭ ᏗᎬᏩᏂᏩᏛᏗ ᏱᎩ, Ꮎ ᏪᏌ ᎠᏂᏓ.

source: The kittens put on their mittens.
chr: ᏪᏌ ᎠᏂᏓ ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏚᎾᎵᏰᏑᎳᏁ.

source: The kittens went up stairs.
chr: ᏪᏌ ᎠᏂᏓ ᎠᎩᏠᏒᏍᏗᎢ ᎦᎸᎳᏗ ᎤᏁᏅᏎ.

source: The kittens will not see them.
chr: Ꮭ ᏱᏙᏛᏂᎪᎯ, Ꮎ ᏪᏌ ᎠᏂᏓ.

source: The magpie can steal.
chr: ᏩᏘᏰᎵ ᎡᎵᏊ ᏱᎦᏃᏍᎩ.

source: The magpie can talk.
chr: ᏩᏘᏰᎵ ᎡᎵᏊ ᏱᎦᏬᏂᎯ.

source: The magpie is a bird.
chr: ᏩᏘᏰᎵ ᏥᏍᏆ.

source: The magpie laughed.
chr: ᏩᏘᏰᎵ ᎤᏰᏘᏎ.

source: The magpie likes to steal.
chr: ᏩᏘᏰᎵ ᎤᏃᏍᎩᏍᏗ ᎤᎸᏉᏗ.

source: The magpie likes to talk.
chr: ᏩᏘᏰᎵ ᎤᏬᏂᎯᏍᏗ ᎤᎸᏉᏗ.

source: The magpie saw the kittens.
chr: ᏩᏘᏰᎵ ᏪᏌ ᎠᏂᏓ ᏚᎪᎮ.

source: The magpie saw the mittens.
chr: ᏩᏘᏰᎵ ᏗᎵᏰᏑᎶ ᏚᎪᎮ.

source: The magpie saw the pie, too.
chr: ᏩᏘᏰᎵ ᎨᎵᏍᏘᎩ ᎥᏍᏊ ᎤᎪᎮ.

source: The naughty magpie stole the mittens.
chr: Ꮎ ᎤᏲᎢ ᏩᏘᏰᎵ ᏗᎵᏰᏑᎶ ᏚᏃᏍᎩᏎ.

source: The naughty magpie!
chr: Ꮎ ᎤᏲ ᏩᏘᏰᎵ!

source: The sky is falling.
chr: ᎦᎸᎶ ᎪᎰᏍᎦ.

source: The sun said that the sky is falling.
chr: ᏅᏓ ᎠᏗᏍᎩ ᎨᏒ Ꮎ ᎦᎸᎶ ᎪᎰᏍᎦ.

source: The tree said that the sky is falling.
chr: ᏡᎬ ᎠᏗᏍᎩ ᎨᏒ Ꮎ ᎦᎸᎶ ᎪᎰᏍᎦ.

source: The tree was as high as the roof.
chr: ᎦᏌᎾᎵ ᎢᎦᏘ ᎢᏳᏍᏗ ᏡᎬ ᎢᎦᏘ.

source: The tricky fox laughed.
chr: ᎤᎶᎾᏍᏔᏅᎢ ᏧᏟ ᎤᏰᏘᏎ.

source: The white silk mittens!
chr: Ꮎ ᏧᏁᎦ ᏏᎵᎩ ᏗᎵᏰᏑᎶ!

source: The wind said that the sky is falling.
chr: ᎤᏃᎴ ᎠᏗᏍᎩ ᎨᏒ Ꮎ ᎦᎸᎶ ᎪᎰᏍᎦ.

source: Then I will get the mittens."
chr: ᎾᎯᏳ ᏗᎵᏰᏑᎶ ᏙᏓᏥᏁᏏ.”

source: Then how could they get into the box?
chr: ᎦᏙ ᎠᏛᏁ, ᎧᏁᏌᎢ ᎡᎵᏊ ᏱᏓᎾᎵᎸᎥᎦ?

source: Then the magpie flew away.
chr: ᎾᎯᏳ ᏩᏘᏰᎵ ᎤᏝᏫᏛᎮᎢ.

source: Then the wind laughed.
chr: ᎾᎯᏳ ᎤᏃᎴ ᎤᏰᏘᏍᎩ ᎨᏎ.

source: Then they began to cry.
chr: ᎠᎾᏠᏱᎮ ᎠᎾᎴᏅᎮ.

source: Then they will boil the mittens.
chr: ᎾᎯᏳ ᏗᎵᏰᏑᎶ ᏙᏛᎾᎵᏟᏓᏂ.

source: Then they will rub, rub, rub!
chr: ᎾᎯᏳ ᏙᏛᎾᏍᎪᎵᏰᎢᎶᎢ!

source: Then you shall have no pie.
chr: ᎾᎯᏳ ᎨᎵᏍᏘᎩ Ꮭ ᏱᏙᏓᏥᎯ.

source: They are clean mittens.
chr: ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ.

source: They are good kittens.
chr: ᎠᏃᏍᏓ ᏪᏌ ᎠᏂᏓ.

source: They are not in the bag.
chr: ᎥᏝ ᏕᎦᎵᏗ ᏯᎾᏯᎠ.

source: They are not in the box.
chr: ᎥᏝ ᎧᏁᏌᎢ ᏯᎾᏯᎠ.

source: They are not in the tub.
chr: ᎥᏝ ᏒᏙᏂ ᏳᎾᏣᎠ.

source: They are not on the chair.
chr: ᎥᏝ ᏗᎦᏍᎩᎶ ᏱᎩ.

source: They are not on the chairs.
chr: ᎥᏝ ᏗᎦᏍᎩᎸ ᏱᎩ.

source: They are not on the line.
chr: ᎥᏝ ᏍᏕᏱᏓᎢ ᏯᎾᏓᎠ.

source: They are not on the shelf.
chr: ᎥᏝ ᎠᏯᏔᎾᎸᎢ ᏳᎾᎩᎳ.

source: They are not on the stairs.
chr: ᎠᎩᏠᏒᏍᏗ ᎥᏝ ᎤᎿ ᏱᎩ.

source: They are not on the table.
chr: ᎥᏝ ᎦᏍᎩᎸᎢ ᏱᎩ.

source: They are white and clean.
chr: ᎥᏍᎩ ᏧᏁᎦ ᎠᎴ ᏧᏓᏅᎦᎸᏓ.

source: They can wash their mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏗᎬᏩᏅᎩᎶᏍᏗ.

source: They could not find their mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏂᏧᏂᏩᏛᎲᎾ.

source: They found their mittens.
chr: ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏩᏛᎮ.

source: They lost their mittens,
chr: ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏲᎱᏎᎴ,

source: They may be in the box.
chr: ᎧᏁᏌᎢ ᎡᎵᏊ ᎤᎾᏣᎠ.

source: They saw something on the roof.
chr: ᎪᎱᏍᏗ ᎦᏌᎾᎵᎢ ᎤᏂᎪᎮ.

source: They went up on the roof.
chr: ᎦᏌᎾᎵᎢ ᎦᏚ ᎤᏂᏯᎸᏎ.

source: They will dry in the sun.
chr: ᎠᎦᎵᏍᎬ ᏛᏂᎧᏲᏏ.

source: They will dry on the line.
chr: ᏍᏕᏱᏓ ᎠᎾᏓᎥ ᏛᏂᎧᏲᏏ.

source: They will dry the mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᏛᏂᎧᏲᏔᏂ.

source: They will hang in the sun.
chr: ᎠᎦᎵᏍᎬ ᎠᎾᏓᎡᏍᏗ.

source: They will hang on the line.
chr: ᏍᏕᏱᏓ ᎠᎾᏓᎡᏍᏗ.

source: They will hang them out in the sun.
chr: ᎠᎦᎵᏍᎬ ᏙᏛᎾᏛᏂ.

source: They will hang them up to dry.
chr: ᎤᏂᎧᏲᎯᏍᏗ ᏙᏛᎾᏛᏂ.

source: They will hang them up.
chr: ᎥᏍᎩ ᏙᏛᎾᏛᏂ.

source: They will put soap on the mittens.
chr: ᎣᏝ ᏛᏂᏝᏂ Ꮎ ᏗᎵᏰᏑᎶ.

source: They will put them in the tub.
chr: ᎥᏍᎩ ᏒᏙᏂ ᏛᏂᎸᏂ.

source: They will soap the mittens.
chr: ᎣᏝ ᏛᏂᏝᏂ Ꮎ ᏗᎵᏰᏑᎶ.

source: This is Chicken Little.
chr: ᎯᎠ ᏥᏔᎦ ᎤᏍᏗ.

source: Three little kittens,
chr: ᎠᏂᏦᎢ ᎤᏍᏗ ᏪᏌ ᎠᏂᏓ,

source: Try not to soil your mittens.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ Ꮭ ᏗᎦᏓᎭ ᏱᎨᏒ ᎢᏣᏁᏟᏔᏅᎭ.

source: We all go to tell the king that the sky is falling."
chr: ᎤᎬᏫᏳᎯ ᎣᏥᏃᎮᏞᎴᎦ ᎦᎸᎶ ᎪᎰᏍᎦ.

source: We all go to tell the king.
chr: ᎤᎬᏫᏳᎯ ᎣᏥᏃᎮᏞᎴᎦ.

source: We all go to tell the king."
chr: ᎤᎬᏫᏳᎯ ᎣᏥᏃᎮᏞᎴᎦ.

source: We are clean kittens, too.
chr: ᎥᏍᏊ ᏦᎦᏓᏅᎦᎸᏓ ᏪᏌ ᎠᏂᏓ.

source: We cannot find them.
chr: ᏂᏦᏥᏩᏛᎲᎾ.

source: We do not know.
chr: Ꮭ ᏲᎦᏅᏔ.

source: We have found our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏩᏔ.

source: We have lost our mittens!
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ!

source: We have mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᎩᎾᎠ.

source: We like our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᎸᏉᏗ.

source: We like our silk mittens.
chr: ᏦᎦᏤᎵ ᏏᎵᎩ ᏗᎵᏰᏑᎶ ᏙᎩᎸᏉᏗ.

source: We like pie.
chr: ᏗᎨᎵᏍᏘᎩ ᏙᎩᎸᏉᏙ.

source: We like to keep our mittens clean.
chr: ᏧᏓᏅᎦᎸᏓ ᎨᏒ ᏙᎩᎸᏉᏗ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ.

source: We like your mittens, too.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᎥᏍᏊ ᏙᎩᎸᏉᏗ.

source: We must find our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᎠᏎ ᏦᎩᏩᏛᏗ.

source: We said, "Mew, mew, mew!"
chr: “ᎻᏳ, ᎻᏳ, ᎻᏳ!” ᎢᏨᏪᏎᎵ.

source: We shall wash them clean.
chr: ᎥᏍᎩᎾ ᏧᏓᏅᎦᎸᏓ ᏙᏓᏲᏨᎩᎶᎢ.

source: We shall wash them in the tub."
chr: ᏒᏙᏂ ᏙᏓᏲᏨᎩᎶᎢ.

source: We shall wash them now.
chr: ᏃᏊ ᏙᏓᏲᏨᎩᎶᎢ.

source: We try to keep our mittens clean.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ ᎨᏒ ᎣᏣᏁᏟᏗᏍᎪ.

source: We try to keep them clean.
chr: ᎥᏍᎩᎾ ᏧᏓᏅᎦᎸᏓ ᎨᏒ ᎣᏣᏁᏟᏗᏍᎪ.

source: We two go to tell the king."
chr: ᎤᎬᏫᏳᎯ ᎣᏍᏗᏃᎮᏞᎴᎦ.”

source: We will have some pie.
chr: ᎨᎵᏍᏘᎩ ᏓᏲᎩᎯ.

source: What do you think they found?
chr: ᎦᏙ ᎤᏍᏗ ᎤᏂᏩᏛᎮ ᎮᎵᎠ?

source: What do you think was there?
chr: ᎦᏙ ᎤᏍᏗ ᎮᎵᎠ?

source: What will he do with them?
chr: ᎦᏙ ᏛᏛᏁᎵ ᎥᏍᎩᎾ ᎬᏗ?

source: What will the kittens do now?
chr: ᎦᏙ ᏃᏊ ᏛᎾᏛᏁᎵ Ꮎ ᏪᏌ ᎠᏂᏓ?

source: What, lost your mittens!
chr: ᎦᏙ, ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏥᏲᎱᏏ!

source: What, lost your mittens?
chr: ᎦᏙ? ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏥᏲᎱᏏ?

source: Where are our mittens?
chr: ᎭᏢ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: Where are they now?
chr: ᎭᏢ ᎥᏍᎩᎾ ᏃᏊ?
